Конфигурация отчетов/Documents/ПланированиеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланированиеЗадачи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДатаПланированияЗдачи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗадачу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЛланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ПланированиеЗадачи/Ext/ManagerModule.bsl
Процедура  СоздатьДокументПланирования(Владелец, СсылкаНаЗадачу, ДатаПланирования) Экспорт 
	Попытка
		Планирование = Документы.ПланированиеЗадачи.СоздатьДокумент();
		Планирование.Дата = ТекущаяДата();
		Планирование.Создал = Владелец;
		Планирование.СсылкаНаЗадачу = СсылкаНаЗадачу;
		Планирование.ДатаЛланирования = ДатаПланирования;
		Планирование.Записать(РежимЗаписиДокумента.Проведение);       
		
		Сообщить("Задача успешно запланирована на " + Формат(Строка(ДатаПланирования),"ДФ=dd.MM.yy; ДЛФ=DD"));
	Исключение
		Сообщить("Не удалось создать документ плавнирования задачи!");
	КонецПопытки;
	
КонецПроцедуры
